{
  "questions": [
    {
      "id": 1,
      "category": "Behavioral",
      "question": "Tell me about a time when you had to deal with a difficult coworker.",
      "hint": "Use the STAR method: Situation, Task, Action, Result. Focus on how you maintained professionalism and resolved the conflict."
    },
    {
      "id": 2,
      "category": "Behavioral",
      "question": "Describe a situation where you had to meet a tight deadline.",
      "hint": "Highlight your time management skills, prioritization abilities, and any tools or techniques you used."
    },
    {
      "id": 3,
      "category": "Behavioral",
      "question": "Give an example of when you showed leadership skills.",
      "hint": "Leadership isn't just about managing people. Consider mentoring, taking initiative, or influencing a decision."
    },
    {
      "id": 4,
      "category": "Behavioral",
      "question": "Tell me about a time you failed. What did you learn?",
      "hint": "Be honest but focus on the learning and growth. Show self-awareness and how you applied the lesson."
    },
    {
      "id": 5,
      "category": "Behavioral",
      "question": "Describe a time when you had to adapt to significant changes at work.",
      "hint": "Demonstrate flexibility and a positive attitude. Explain your thought process during the transition."
    },
    {
      "id": 6,
      "category": "Technical",
      "question": "Explain the difference between REST and GraphQL.",
      "hint": "REST uses multiple endpoints with standard HTTP methods. GraphQL uses a single endpoint with flexible queries. Discuss pros/cons of each."
    },
    {
      "id": 7,
      "category": "Technical",
      "question": "What is the difference between SQL and NoSQL databases?",
      "hint": "SQL: structured, relational, ACID compliance. NoSQL: flexible schema, horizontal scaling, various types (document, key-value, etc.)."
    },
    {
      "id": 8,
      "category": "Technical",
      "question": "Explain what CI/CD means and why it's important.",
      "hint": "Continuous Integration/Continuous Deployment. Automates testing and deployment, catches bugs early, enables faster releases."
    },
    {
      "id": 9,
      "category": "Technical",
      "question": "What is the difference between authentication and authorization?",
      "hint": "Authentication: verifying who you are (login). Authorization: verifying what you can access (permissions)."
    },
    {
      "id": 10,
      "category": "Technical",
      "question": "Explain how you would optimize a slow database query.",
      "hint": "Consider indexing, query optimization, analyzing execution plans, avoiding N+1 queries, caching, and database design."
    },
    {
      "id": 11,
      "category": "Technical",
      "question": "What is the difference between HTTP and HTTPS?",
      "hint": "HTTPS uses SSL/TLS encryption for secure communication. Discuss certificates, encryption, and why security matters."
    },
    {
      "id": 12,
      "category": "HR",
      "question": "Why do you want to work for our company?",
      "hint": "Research the company's mission, values, and recent achievements. Connect their goals to your career aspirations."
    },
    {
      "id": 13,
      "category": "HR",
      "question": "Where do you see yourself in 5 years?",
      "hint": "Show ambition but be realistic. Align your goals with potential growth paths at the company."
    },
    {
      "id": 14,
      "category": "HR",
      "question": "What is your expected salary range?",
      "hint": "Research market rates for your role and location. Provide a range rather than a specific number. Be prepared to justify it."
    },
    {
      "id": 15,
      "category": "HR",
      "question": "Why are you leaving your current job?",
      "hint": "Stay positive. Focus on seeking growth opportunities, not running from problems. Never badmouth previous employers."
    },
    {
      "id": 16,
      "category": "HR",
      "question": "What are your greatest strengths and weaknesses?",
      "hint": "For strengths: provide examples. For weaknesses: be genuine but show how you're working to improve."
    },
    {
      "id": 17,
      "category": "HR",
      "question": "Do you have any questions for us?",
      "hint": "Always have questions ready! Ask about team culture, growth opportunities, current challenges, or day-to-day responsibilities."
    },
    {
      "id": 18,
      "category": "Behavioral",
      "question": "Tell me about yourself",
      "hint": "*please make pauses and sound like a real person, don’t rush\n\nI’ve been working in QA for the past __ months/years, \nmaking sure that everything works, looks and feels good\nmainly focusing on functional and UI testing,\ntesting both Web and Mobile applications, \nMaking sure that requirements are implemented and reporting issues in Jira.\nworking with iOS, Android, Windows, and Mac.\nI have a lot of experience with creating and maintaining QA documentation, \nusing Testrail to create and execute test cases.\nWorking with tools like Chrome Dev Tools, Xcode, Android Studio, ADB and Unix.\nworked closely with Development and Product Management\n....Well that’s pretty much it… \nPlease feel free to ask if you have any particular questions."
    },
    {
      "id": 19,
      "category": "Behavioral",
      "question": "What are your strengths? Why we should hire you?",
      "hint": "I’m detail-oreinted and i pay a lot of attention to details, that’s why i catch a lot of bugs\nI have a lot of experience testing web and mobile application (depends on what they need)\nI’m always being the voice of the costumer, advocating the costumer to provide the best possible user experience\nI love to break things. I have a passion for quality, which will improve the user experience"
    },
    {
      "id": 20,
      "category": "Behavioral",
      "question": "What would you do if a developer reassigns a ticket/bug back to you and marks it as “as-designed” / “not a bug”?",
      "hint": "I will double-check the requirements, if according to the requirements it’s expected behavior - \nI will close the bug and leave a comment, \n\nBUT if it’s not expected according to requirements -  I will reopen the bug, assign it back to the developer and leave a comment,\n\nIf the requirements are not clear or maybe missing, I will ask the product manager for clarifications. \n\nAnd will close or reopen the ticket based on his/her answer. \n-----------------------------------------------------------------------------------------------------------------\n*Always leave a comment"
    },
    {
      "id": 21,
      "category": "Behavioral",
      "question": "If you need to complete 80 test cases in 5 days, but after the first day you completed 8 test cases, what will you do?",
      "hint": "I will continue executing test cases, also I will raise a concern to the QA Manager that we might need more time or effort/resources/people to finish this testing on time - if I see that the test cases are complicated or time-consuming."
    },
    {
      "id": 22,
      "category": "Technical",
      "question": "How do you measure the success and ROI of your automation efforts?",
      "hint": "I measure the success and ROI of automation efforts using metrics like test\ncoverage, defect detection rate, test execution time, and cost savings. I track the\nnumber of automated tests, the percentage of test cases automated, and the\nreduction in manual testing effort. I also analyze the impact of automation on\nthe overall quality of the application and the time-to-market. I present these\nmetrics to stakeholders and use them to justify the investment in automation\nand identify areas for improvement."
    },
    {
      "id": 23,
      "category": "Technical",
      "question": "How do you conduct functional testing of APIs?",
      "hint": "Functional testing tests if the API performs its intended operations accurately and\nconsistently. It includes the following tests:• Endpoint Validation: Validate if the API endpoints respond to requests as expected.\nExample: Testing if the GET /user/{id} endpoint retrieves the correct user details for\na given ID.\nInput Validation: Test how the API handles various input scenarios:\no Valid inputs.\no Invalid inputs (e.g., incorrect data types or missing required fields).\no Boundary values (e.g., maximum or minimum allowable input sizes).\nExample: Testing an API that accepts a date range to ensure it rejects malformed dates\nlike 32-13-2025.\nBusiness Logic Testing: Validate that the API implements the defined business rules\ncorrectly and completely. Example: For an e-commerce API, ensure the POST\n/applyCoupon endpoint allows discounts only on eligible products.\nDependency Validation: Test how APIs interact with other services. Example: If an API\ntriggers a payment gateway, test if the API handles responses like success, failure, and\ntimeout correctly.\nTip: Use tools like Postman to design and execute functional test cases effectively.\nAutomate repetitive tests with libraries like REST Assured for scalability."
    },
    {
      "id": 24,
      "category": "Technical",
      "question": "Can you explain smoke and sanity testing?",
      "hint": "Smoke Testing: Basic test to check app stability before deeper testing\nSanity Testing: Quick test to verify specific bug fixes or functionality after changes\nScenario:\nAfter a new build is deployed:\n- Smoke Test: Can we log in? Navigate? Load dashboard?\n- Sanity Test: Was the cart issue fixed? Check only that feature."
    },
    {
      "id": 25,
      "category": "Technical",
      "question": "How do you test CI/CD pipeline for automation tests? What steps do you take to validate that your pipeline is properly executing tests, catching failures, and reporting results?",
      "hint": "Answer:\n• Verify Jenkins job triggers on code push.\n• Smoke tests run first, regression later.\n• Report published (Allure/Extent).\n• Slack/email notifications configured.\n👉 Example:\nBug: Jenkins marked build “green” even when 10% tests failed due to incorrect exit code handling.\n\nStrong answers should include:\n\nValidation of pipeline configuration (syntax, structure)\nTesting in a non-production environment first\nVerifying test execution (all tests run, none skipped)\nChecking failure detection (intentionally failing tests)\nValidating reporting and notifications\nMonitoring pipeline performance/timing\nEnvironment variable and secrets validation"
    },
    {
      "id": 26,
      "category": "Technical",
      "question": "How do you test if Acceptance Criteria (AC) is unclear in a story?",
      "hint": "Answer:\n• Ask clarifying questions in grooming/refinement.\n• Use 3 Amigos approach (Dev, QA, PO).\n• Document assumptions if PO not available.\n👉 Example:\nAC said: “User should see discounts.” I asked → Flat discount or percentage? Applied before or after tax? →\nFound missing business rules."
    },
    {
      "id": 27,
      "category": "Technical",
      "question": "Write a function that takes a string as input and returns the character that appears most frequently in that string, along with how many times it appears.",
      "hint": "function mostFrequentChar(str) {\n  // Edge case: empty string\n  if (!str || str.length === 0) {\n    return null;\n  }\n  \n  // Count frequency of each character\n  const charCount = {};\n  \n  for (let char of str) {\n    charCount[char] = (charCount[char] || 0) + 1;\n  }\n  \n  // Find the character with max count\n  let maxChar = '';\n  let maxCount = 0;\n  \n  for (let char in charCount) {\n    if (charCount[char] > maxCount) {\n      maxCount = charCount[char];\n      maxChar = char;\n    }\n  }\n  \n  return { character: maxChar, count: maxCount };\n}"
    },
    {
      "id": 28,
      "category": "Behavioral",
      "question": "What test design techniques do you know and use?",
      "hint": ""
    },
    {
      "id": 29,
      "category": "Behavioral",
      "question": "When do you add new test cases to the regression suite ?",
      "hint": ""
    },
    {
      "id": 30,
      "category": "Technical",
      "question": "Can we store images or pdfs in a database ?",
      "hint": ""
    }
  ]
}